---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ChangeDimensionSegmentFailed
source: html/45dd834a-78ce-1e76-8c34-88fc4e5c0122.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ChangeDimensionSegmentFailed Property

Can't change dimension segment to this value.

## Syntax (C#)
```csharp
public static FailureDefinitionId ChangeDimensionSegmentFailed { get; }
```